telespial/EdgeAI_sphere_demo_NXP_FRDM-MCXN947/src/edgeai_sand_demo.c
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "accel4_click.h"
#include "fxls8974cf.h"
#include "par_lcd_s035.h"
#include "sw_render.h"
#include "npu/model.h"

#include "app.h"
#include "board.h"
#include "clock_config.h"
#include "fsl_clock.h"
#include "fsl_debug_console.h"
#include "fsl_lpi2c.h"
#include "pin_mux.h"

#define LCD_W 480
#define LCD_H 320

/* Tile renderer maximum blit size. Keep in sync with the tile buffer allocation. */
#define EDGEAI_TILE_MAX_W 200
#define EDGEAI_TILE_MAX_H 200

/* Ball radius tuning.
 * We apply a simple depth cue: ball gets smaller toward the top ("far") and larger toward the
 * bottom ("near") to better match the dune background's perspective.
 */
#define BALL_R_BASE 20
#define BALL_R_MIN  12
#define BALL_R_MAX  34

static int32_t edgeai_ball_r_for_y(int32_t cy)
{
    /* Map screen y to [0..256] where 0 is "far" and 256 is "near". */
    const int32_t y_far = 26;
    const int32_t y_near = LCD_H - 26;
    int32_t denom = (y_near - y_far);
    int32_t t_q8 = 256;
    if (denom > 0)
    {
        int32_t num = cy - y_far;
        if (num < 0) num = 0;
        if (num > denom) num = denom;
        t_q8 = (num * 256) / denom;
    }

    /* Radius ramps from MIN..MAX. */
    int32_t r = BALL_R_MIN + ((t_q8 * (BALL_R_MAX - BALL_R_MIN)) / 256);
    if (r < BALL_R_MIN) r = BALL_R_MIN;
    if (r > BALL_R_MAX) r = BALL_R_MAX;
    (void)BALL_R_BASE;
    return r;
}

/* Empirically, the raw 12-bit output here is roughly on the order of ~512 counts per 1g
 * at the current FXLS8974 config. We use this as the full-scale tilt mapping value.
 */
#define ACCEL_MAP_DENOM 512

/* Accel axis mapping (adjust if needed). */
#ifndef EDGEAI_ACCEL_SWAP_XY
#define EDGEAI_ACCEL_SWAP_XY 1
#endif
#ifndef EDGEAI_ACCEL_INVERT_X
#define EDGEAI_ACCEL_INVERT_X 0
#endif
#ifndef EDGEAI_ACCEL_INVERT_Y
#define EDGEAI_ACCEL_INVERT_Y 0
#endif

#ifndef EDGEAI_I2C
#define EDGEAI_I2C LPI2C3
#endif

/* NPU: keep init enabled, but inference can be disabled if it blocks on a given setup. */
#ifndef EDGEAI_ENABLE_NPU_INFERENCE
#define EDGEAI_ENABLE_NPU_INFERENCE 0
#endif

/* Rendering mode:
 * - 0: "raster/flicker" mode: draw primitives directly to LCD using many small writes
 *      (visually interesting but can show tearing/shutter lines).
 * - 1: "single blit" mode: render into a RAM tile and blit once per frame
 *      (stable image, much less tearing).
 */
#ifndef EDGEAI_RENDER_SINGLE_BLIT
#define EDGEAI_RENDER_SINGLE_BLIT 1
#endif

static uint32_t edgeai_i2c_get_freq(void)
{
    return CLOCK_GetLPFlexCommClkFreq(3u);
}

static bool edgeai_i2c_write(uint8_t addr7, uint8_t reg, const uint8_t *data, uint32_t len)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1;
    xfer.data = (uint8_t *)data;
    xfer.dataSize = len;
    xfer.flags = kLPI2C_TransferDefaultFlag;
    return (LPI2C_MasterTransferBlocking(EDGEAI_I2C, &xfer) == kStatus_Success);
}

static bool edgeai_i2c_read(uint8_t addr7, uint8_t reg, uint8_t *data, uint32_t len)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1;
    xfer.data = data;
    xfer.dataSize = len;
    xfer.flags = kLPI2C_TransferDefaultFlag;
    return (LPI2C_MasterTransferBlocking(EDGEAI_I2C, &xfer) == kStatus_Success);
}

static void map_accel_xy(int32_t *ax, int32_t *ay)
{
    if (!ax || !ay) return;
#if EDGEAI_ACCEL_SWAP_XY
    int32_t tmp = *ax; *ax = *ay; *ay = tmp;
#endif
#if EDGEAI_ACCEL_INVERT_X
    *ax = -*ax;
#endif
#if EDGEAI_ACCEL_INVERT_Y
    *ay = -*ay;
#endif
}

static int32_t clamp_i32(int32_t v, int32_t lo, int32_t hi)
{
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
}

static void dwt_cycle_counter_init(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

static int32_t abs_i32(int32_t v) { return (v < 0) ? -v : v; }

static int32_t clamp_i32_sym(int32_t v, int32_t limit_abs)
{
    if (v > limit_abs) return limit_abs;
    if (v < -limit_abs) return -limit_abs;
    return v;
}

static uint32_t edgeai_xorshift32(uint32_t *s)
{
    /* Simple deterministic PRNG for waypoint selection. */
    uint32_t x = (*s == 0u) ? 0x6D2B79F5u : *s;
    x ^= x << 13;
    x ^= x >> 17;
    x ^= x << 5;
    *s = x;
    return x;
}

#if EDGEAI_RENDER_SINGLE_BLIT
static void edgeai_render_full_dune(uint16_t *tile)
{
    for (int32_t y0 = 0; y0 < LCD_H; y0 += EDGEAI_TILE_MAX_H)
    {
        for (int32_t x0 = 0; x0 < LCD_W; x0 += EDGEAI_TILE_MAX_W)
        {
            int32_t w = LCD_W - x0;
            int32_t h = LCD_H - y0;
            if (w > EDGEAI_TILE_MAX_W) w = EDGEAI_TILE_MAX_W;
            if (h > EDGEAI_TILE_MAX_H) h = EDGEAI_TILE_MAX_H;
            int32_t x1 = x0 + w - 1;
            int32_t y1 = y0 + h - 1;

            sw_render_dune_bg(tile, (uint32_t)w, (uint32_t)h, x0, y0);
            par_lcd_s035_blit_rect(x0, y0, x1, y1, tile);
        }
    }
}
#endif

static bool edgeai_init_accel(fxls8974_dev_t *dev, uint8_t *who_out)
{
    if (who_out) *who_out = 0;
    if (!dev) return false;

    /* Init I2C for the accel (mikroBUS). */
    lpi2c_master_config_t masterCfg;
    LPI2C_MasterGetDefaultConfig(&masterCfg);
    /* Be conservative; some shield/cable setups are flaky at 400k. */
    masterCfg.baudRate_Hz = 100000u;
    LPI2C_MasterInit(EDGEAI_I2C, &masterCfg, edgeai_i2c_get_freq());

    const uint8_t addrs[] = {ACCEL4_CLICK_I2C_ADDR0, ACCEL4_CLICK_I2C_ADDR1};
    uint8_t who = 0;
    bool found = false;
    /* Retry accel bring-up briefly; cold boots can race sensor power-up. */
    for (uint32_t tries = 0; tries < 200; tries++) /* ~2s */
    {
        for (size_t i = 0; i < (sizeof(addrs) / sizeof(addrs[0])); i++)
        {
            dev->addr7 = addrs[i];
            if (fxls8974_read_whoami(dev, &who) && (who == FXLS8974_WHO_AM_I_VALUE))
            {
                found = true;
                break;
            }
        }
        if (found) break;
        SDK_DelayAtLeastUs(10000u, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    }

