telespial/EdgeAI_sphere_demo_NXP_FRDM-MCXN947/src/edgeai_sand_demo.c
    if (who_out) *who_out = who;
    if (!found)
    {
        PRINTF("EDGEAI: FXLS8974CF not found (WHO_AM_I=0x%02x). Continuing without accel.\r\n", who);
        return false;
    }

    (void)fxls8974_set_active(dev, false);
    (void)fxls8974_set_fsr(dev, FXLS8974_FSR_4G);
    (void)fxls8974_set_active(dev, true);
    PRINTF("EDGEAI: accel ok addr=0x%02x\r\n", (unsigned)dev->addr7);
    return true;
}

static const uint8_t *edgeai_glyph5x7(char c)
{
    /* Each glyph is 7 rows, 5 bits wide, MSB-first in the low 5 bits (bit 4..0). */
    static const uint8_t SPACE[7] = {0, 0, 0, 0, 0, 0, 0};
    static const uint8_t A[7] = {0x0E, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11};
    static const uint8_t D[7] = {0x1E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x1E};
    static const uint8_t E[7] = {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x1F};
    static const uint8_t N[7] = {0x11, 0x19, 0x15, 0x13, 0x11, 0x11, 0x11};
    static const uint8_t S[7] = {0x0F, 0x10, 0x10, 0x0E, 0x01, 0x01, 0x1E};
    static const uint8_t U[7] = {0x11, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E};

    switch (c)
    {
        case 'A': return A;
        case 'D': return D;
        case 'E': return E;
        case 'N': return N;
        case 'S': return S;
        case 'U': return U;
        case ' ': return SPACE;
        default: return SPACE;
    }
}

static void edgeai_draw_char5x7_scaled(int32_t x, int32_t y, int32_t scale, char c, uint16_t color)
{
    const uint8_t *g = edgeai_glyph5x7(c);
    if (scale < 1) scale = 1;

    for (int32_t row = 0; row < 7; row++)
    {
        uint8_t bits = g[row];
        for (int32_t col = 0; col < 5; col++)
        {
            if (bits & (1u << (4 - col)))
            {
                int32_t x0 = x + col * scale;
                int32_t y0 = y + row * scale;
                par_lcd_s035_fill_rect(x0, y0, x0 + scale - 1, y0 + scale - 1, color);
            }
        }
    }
}

static void edgeai_draw_text5x7_scaled(int32_t x, int32_t y, int32_t scale, const char *s, uint16_t color)
{
    int32_t cx = x;
    while (*s)
    {
        edgeai_draw_char5x7_scaled(cx, y, scale, *s, color);
        cx += (5 + 1) * scale;
        s++;
    }
}

static int32_t edgeai_text5x7_w(int32_t scale, const char *s)
{
    int32_t n = 0;
    while (s[n]) n++;
    if (n == 0) return 0;
    return n * (5 + 1) * scale - 1 * scale; /* last char doesn't need trailing space */
}

static void edgeai_draw_boot_title_sand_dune(void)
{
    const int32_t scale = 7;
    const char *l1 = "SAND";
    const char *l2 = "DUNE";

    int32_t w1 = edgeai_text5x7_w(scale, l1);
    int32_t w2 = edgeai_text5x7_w(scale, l2);
    int32_t w = (w1 > w2) ? w1 : w2;
    int32_t h = 2 * (7 * scale) + (2 * scale);

    int32_t x = (LCD_W - w) / 2;
    int32_t y = (LCD_H - h) / 2;

    /* Simple 3D look: shadow then face. */
    const int32_t ox = 4;
    const int32_t oy = 4;
    const uint16_t shadow = 0x2104u; /* dark gray */
    const uint16_t face = 0xFFDEu;   /* warm white */

    edgeai_draw_text5x7_scaled(x + ox, y + oy, scale, l1, shadow);
    edgeai_draw_text5x7_scaled(x + ox, y + oy + (7 * scale) + (2 * scale), scale, l2, shadow);
    edgeai_draw_text5x7_scaled(x, y, scale, l1, face);
    edgeai_draw_text5x7_scaled(x, y + (7 * scale) + (2 * scale), scale, l2, face);
}

int main(void)
{
    BOARD_InitHardware();
    dwt_cycle_counter_init();

    /* Bring up LCD early so we can always show something even if accel init fails. */
    if (!par_lcd_s035_init())
    {
        /* Can't proceed without display in this demo. */
        for (;;) {}
    }
    par_lcd_s035_fill(0x0000u); /* boot stays black (dune reveals as you roll) */
    edgeai_draw_boot_title_sand_dune();
    SDK_DelayAtLeastUs(3000000u, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    par_lcd_s035_fill(0x0000u);

    /* Print banner early; previous hangs made it hard to tell if firmware was alive. */
    PRINTF("EDGEAI: boot %s %s\r\n", __DATE__, __TIME__);

    fxls8974_dev_t dev = {
        .addr7 = 0,
        .write = edgeai_i2c_write,
        .read = edgeai_i2c_read,
    };
    uint8_t who = 0;
    bool found = false;
    bool accel_inited = false;

    bool npu_ok = (EDGEAI_MODEL_Init() == kStatus_Success);
    edgeai_tensor_dims_t in_dims = {0};
    edgeai_tensor_type_t in_type = kEdgeAiTensorType_UINT8;
    uint8_t *in_data = NULL;
    edgeai_tensor_dims_t out_dims = {0};
    edgeai_tensor_type_t out_type = kEdgeAiTensorType_UINT8;
    uint8_t *out_data = NULL;
    if (npu_ok)
    {
        in_data = EDGEAI_MODEL_GetInputTensorData(&in_dims, &in_type);
        out_data = EDGEAI_MODEL_GetOutputTensorData(&out_dims, &out_type);
        npu_ok = (in_data != NULL) && (out_data != NULL);
    }

    /* Ball state (Q16.16 pixels). */
    int32_t x_q16 = (LCD_W / 2) << 16;
    int32_t y_q16 = (LCD_H / 2) << 16;
    int32_t vx_q16 = 0;
    int32_t vy_q16 = 0;
    int32_t prev_x = LCD_W / 2;
    int32_t prev_y = LCD_H / 2;

    /* Simple trail. */
    enum { TRAIL_N = 12 };
    int16_t trail_x[TRAIL_N];
    int16_t trail_y[TRAIL_N];
    for (int i = 0; i < TRAIL_N; i++) { trail_x[i] = (int16_t)prev_x; trail_y[i] = (int16_t)prev_y; }
    uint32_t trail_head = 0;

    /* Simple low-pass on accel; we map tilt directly to screen position. */
    int32_t ax_lp = 0;
    int32_t ay_lp = 0;

    fxls8974_sample_t s = {0};
    uint32_t last_cyc = DWT->CYCCNT;
    uint32_t frame = 0;
    uint8_t glint = 0;
    uint32_t accel_fail = 0;
    uint32_t npu_accum_us = 0;
    uint32_t stats_accum_us = 0;
    uint32_t stats_frames = 0;

    /* Maximum dirty-rect size. Even in raster mode we clamp work per frame. */
    enum { TILE_MAX_W = EDGEAI_TILE_MAX_W, TILE_MAX_H = EDGEAI_TILE_MAX_H };
#if EDGEAI_RENDER_SINGLE_BLIT
    /* Tile renderer (one LCD blit per frame to avoid tearing/flicker). */
    static uint16_t tile[TILE_MAX_W * TILE_MAX_H];
#endif

    /* Intro routine: after the boot title, drive the ball via synthetic input to paint the dune
     * background over the entire screen (so no black remains), then enable accel input.
     */
    typedef enum { EDGEAI_MODE_AUTOPAINT = 0, EDGEAI_MODE_NORMAL = 1 } edgeai_mode_t;
    edgeai_mode_t mode = EDGEAI_MODE_AUTOPAINT;

