telespial/EdgeAI_sphere_demo_NXP_FRDM-MCXN947/src/edgeai_sand_demo.c
    /* Coverage tracking: mark a coarse grid as visited when the ball enters a cell. When all
     * cells are visited, do a final full-screen dune sweep and hand off to the accelerometer.
     */
    enum { CELL_W = 40, CELL_H = 40, GRID_COLS = (LCD_W / CELL_W), GRID_ROWS = (LCD_H / CELL_H) };
    enum { GRID_N = GRID_COLS * GRID_ROWS };
    uint8_t visited[GRID_N];
    memset(visited, 0, sizeof(visited));
    uint32_t visited_n = 0;

    uint32_t rng = (uint32_t)DWT->CYCCNT ^ 0xA341316Cu;
    int32_t target_x = prev_x;
    int32_t target_y = prev_y;

    const int32_t bound_minx = BALL_R_MAX + 2;
    const int32_t bound_miny = BALL_R_MAX + 2;
    const int32_t bound_maxx = (LCD_W - 1) - (BALL_R_MAX + 2);
    const int32_t bound_maxy = (LCD_H - 1) - (BALL_R_MAX + 2);

    /* Boot banner: keep it short and printf-lite compatible (avoid %ld). */
    PRINTF("EDGEAI: tilt-ball (npu_init=%u npu_run=%u render=%s)\r\n",
           (unsigned)(npu_ok ? 1u : 0u),
           (unsigned)(EDGEAI_ENABLE_NPU_INFERENCE ? 1u : 0u),
           (EDGEAI_RENDER_SINGLE_BLIT ? "blit" : "raster"));

    /* Some MCXN947 configurations (or secure setups) can leave DWT->CYCCNT not advancing,
     * which makes dt==0 and "freezes" all motion. Keep a fixed timestep fallback so
     * the demo always behaves predictably.
     */
    const int32_t dt_fallback_q16 = (int32_t)((1u << 16) / 60u); /* ~16.67ms */
    const uint32_t dt_fallback_us = 16667u;

    /* Fixed-step simulation + throttled rendering.
     * Without this, if the loop runs very fast (small dt), the per-iteration damping can
     * effectively "lock" velocity near zero and the ball looks stuck.
     */
    const int32_t sim_step_q16 = (int32_t)((1u << 16) / 120u); /* 120 Hz physics */
    int32_t sim_accum_q16 = 0;
    uint32_t render_accum_us = 0;
    const uint32_t render_period_us = 16667u; /* ~60 FPS */

    for (;;)
    {
        bool accel_ok = false;
        if ((mode == EDGEAI_MODE_NORMAL) && found)
        {
            accel_ok = fxls8974_read_sample_12b(&dev, &s);
        }
        if (!accel_ok)
        {
            /* Keep the render loop alive even if I2C glitches; this prevents the
             * display from appearing "frozen" without any indication why.
             */
            accel_fail++;
            s.x = 0;
            s.y = 0;
            s.z = 0;
        }
        else
        {
            accel_fail = 0;
        }

        uint32_t now = DWT->CYCCNT;
        uint32_t dc = now - last_cyc;
        last_cyc = now;
        uint32_t cps = SystemCoreClock ? SystemCoreClock : 150000000u;

        /* dt in Q16 seconds */
        int32_t dt_q16 = dt_fallback_q16;
        uint32_t dt_us = dt_fallback_us;
        if ((dc != 0u) && (cps != 0u))
        {
            dt_q16 = (int32_t)(((uint64_t)dc << 16) / (uint64_t)cps);
            dt_us = (uint32_t)(((uint64_t)dc * 1000000u) / (uint64_t)cps);
            if (dt_q16 <= 0) dt_q16 = dt_fallback_q16;
            if (dt_us == 0u) dt_us = dt_fallback_us;
        }

        if (dt_q16 > (int32_t)(1u << 16)) dt_q16 = (int32_t)(1u << 16);
        npu_accum_us += dt_us;
        stats_accum_us += dt_us;
        render_accum_us += dt_us;
        sim_accum_q16 += dt_q16;

        int32_t ax = (int32_t)s.x;
        int32_t ay = (int32_t)s.y;
        map_accel_xy(&ax, &ay);

        /* Faster LP so small tilts respond quickly. */
        ax_lp += (ax - ax_lp) >> 2;
        ay_lp += (ay - ay_lp) >> 2;

        /* Raw 12b is roughly ~512 counts / 1g at our current mode. Clamp to avoid crazy jumps. */
        ax_lp = clamp_i32(ax_lp, -ACCEL_MAP_DENOM * 2, ACCEL_MAP_DENOM * 2);
        ay_lp = clamp_i32(ay_lp, -ACCEL_MAP_DENOM * 2, ACCEL_MAP_DENOM * 2);

        /* Deadzone + soft response curve (arcade "marble" feel).
         * We use a small deadzone then a blended linear/cubic curve so it isn't twitchy
         * near center, but still responds strongly at larger tilts.
         */
        const int32_t deadzone = 10; /* counts */
        int32_t ax_dz = ax_lp;
        int32_t ay_dz = ay_lp;
        if (abs_i32(ax_dz) <= deadzone) ax_dz = 0;
        else ax_dz -= (ax_dz > 0) ? deadzone : -deadzone;
        if (abs_i32(ay_dz) <= deadzone) ay_dz = 0;
        else ay_dz -= (ay_dz > 0) ? deadzone : -deadzone;

        /* Normalize to Q15 ~= [-1,1] at 1g. */
        int32_t ax_n_q15 = (int32_t)(((int64_t)ax_dz << 15) / (int64_t)ACCEL_MAP_DENOM);
        int32_t ay_n_q15 = (int32_t)(((int64_t)ay_dz << 15) / (int64_t)ACCEL_MAP_DENOM);
        ax_n_q15 = clamp_i32_sym(ax_n_q15, 32767);
        ay_n_q15 = clamp_i32_sym(ay_n_q15, 32767);

        /* cubic = x^3 (Q15) */
        int32_t ax2 = (int32_t)(((int64_t)ax_n_q15 * ax_n_q15) >> 15);
        int32_t ay2 = (int32_t)(((int64_t)ay_n_q15 * ay_n_q15) >> 15);
        int32_t ax_cu_q15 = (int32_t)(((int64_t)ax2 * ax_n_q15) >> 15);
        int32_t ay_cu_q15 = (int32_t)(((int64_t)ay2 * ay_n_q15) >> 15);

        /* Blend: 35% linear + 65% cubic (alpha in Q15). */
        const int32_t alpha_q15 = 11469; /* ~0.35 */
        int32_t ax_soft_q15 = (int32_t)(((int64_t)ax_n_q15 * alpha_q15 +
                                         (int64_t)ax_cu_q15 * ((1 << 15) - alpha_q15)) >> 15);
        int32_t ay_soft_q15 = (int32_t)(((int64_t)ay_n_q15 * alpha_q15 +
                                         (int64_t)ay_cu_q15 * ((1 << 15) - alpha_q15)) >> 15);

        if (mode == EDGEAI_MODE_AUTOPAINT)
        {
            /* Choose a random unvisited cell to steer toward. */
            if (visited_n < GRID_N)
            {
                int idx = -1;
                for (int t = 0; t < 64; t++)
                {
                    int cand = (int)(edgeai_xorshift32(&rng) % (uint32_t)GRID_N);
                    if (!visited[cand]) { idx = cand; break; }
                }
                if (idx < 0)
                {
                    for (int i = 0; i < GRID_N; i++) if (!visited[i]) { idx = i; break; }
                }
                if (idx >= 0)
                {
                    int row = idx / GRID_COLS;
                    int col = idx % GRID_COLS;
                    int32_t tx = col * CELL_W + (CELL_W / 2);
                    int32_t ty = row * CELL_H + (CELL_H / 2);
                    target_x = clamp_i32(tx, bound_minx, bound_maxx);
                    target_y = clamp_i32(ty, bound_miny, bound_maxy);
                }
            }

            /* Autopilot: PD controller to drive toward the current target. */
            int32_t cx_now = x_q16 >> 16;
            int32_t cy_now = y_q16 >> 16;
            int32_t ex = target_x - cx_now;
            int32_t ey = target_y - cy_now;
            int32_t vx_px_s = vx_q16 >> 16;
            int32_t vy_px_s = vy_q16 >> 16;

            const int32_t a_px_s2 = 4200;
            int32_t ux = ex * 28 - vx_px_s * 85;
            int32_t uy = ey * 28 - vy_px_s * 85;
            ux = clamp_i32(ux, -a_px_s2, a_px_s2);
            uy = clamp_i32(uy, -a_px_s2, a_px_s2);

            ax_soft_q15 = (int32_t)(((int64_t)ux * 32767) / (int64_t)a_px_s2);
            ay_soft_q15 = (int32_t)(((int64_t)uy * 32767) / (int64_t)a_px_s2);
        }

