telespial/EdgeAI_sphere_demo_NXP_FRDM-MCXN947/src/edgeai_sand_demo.c
        /* If accel read is failing, force a visible change so it doesn't look like
         * the demo is broken in a mysterious way.
         */
#if !EDGEAI_RENDER_SINGLE_BLIT
        uint16_t bg = (accel_fail > 0) ? 0x1800u /* dark red */ : 0x0000u;
#endif

        /* Physics: fixed-step integration at sim_step_q16. */
        const int32_t a_px_s2 = 4200; /* px/s^2 at ~1g (arcade, not twitchy) */
        /* soft_q15 * a_px_s2 gives Q15 px/s^2; convert to Q16 by <<1 */
        int32_t ax_a_q16 = (int32_t)(((int64_t)ax_soft_q15 * a_px_s2) << 1);
        int32_t ay_a_q16 = (int32_t)(((int64_t)ay_soft_q15 * a_px_s2) << 1);

        /* Use the max radius here so the "near" ball can't clip the screen edge. */
        const int32_t minx = BALL_R_MAX + 2;
        const int32_t miny = BALL_R_MAX + 2;
        const int32_t maxx = (LCD_W - 1) - (BALL_R_MAX + 2);
        const int32_t maxy = (LCD_H - 1) - (BALL_R_MAX + 2);

        int iter = 0;
        while ((sim_accum_q16 >= sim_step_q16) && (iter < 6))
        {
            sim_accum_q16 -= sim_step_q16;
            iter++;

            vx_q16 += (int32_t)(((int64_t)ax_a_q16 * sim_step_q16) >> 16);
            vy_q16 += (int32_t)(((int64_t)ay_a_q16 * sim_step_q16) >> 16);

            /* Damping (Q16) tuned for the fixed sim rate. */
            const int32_t damp = 65000; /* ~0.992 @ 120 Hz */
            vx_q16 = (int32_t)(((int64_t)vx_q16 * damp) >> 16);
            vy_q16 = (int32_t)(((int64_t)vy_q16 * damp) >> 16);

            x_q16 += (int32_t)(((int64_t)vx_q16 * sim_step_q16) >> 16);
            y_q16 += (int32_t)(((int64_t)vy_q16 * sim_step_q16) >> 16);

            int32_t cx_s = x_q16 >> 16;
            int32_t cy_s = y_q16 >> 16;
            if (cx_s < minx) { cx_s = minx; x_q16 = cx_s << 16; vx_q16 = -(vx_q16 * 3) / 4; }
            if (cx_s > maxx) { cx_s = maxx; x_q16 = cx_s << 16; vx_q16 = -(vx_q16 * 3) / 4; }
            if (cy_s < miny) { cy_s = miny; y_q16 = cy_s << 16; vy_q16 = -(vy_q16 * 3) / 4; }
            if (cy_s > maxy) { cy_s = maxy; y_q16 = cy_s << 16; vy_q16 = -(vy_q16 * 3) / 4; }
        }

        int32_t cx = x_q16 >> 16;
        int32_t cy = y_q16 >> 16;
        int32_t r_draw = edgeai_ball_r_for_y(cy);

        bool do_render = (render_accum_us >= render_period_us);
        if (do_render) render_accum_us = 0;

        if (do_render)
        {
            if (mode == EDGEAI_MODE_AUTOPAINT)
            {
                /* Mark coverage based on current ball center. */
                int32_t gx = cx / CELL_W;
                int32_t gy = cy / CELL_H;
                if (gx < 0) gx = 0;
                if (gy < 0) gy = 0;
                if (gx >= GRID_COLS) gx = GRID_COLS - 1;
                if (gy >= GRID_ROWS) gy = GRID_ROWS - 1;
                int gi = gy * GRID_COLS + gx;
                if ((gi >= 0) && (gi < GRID_N) && !visited[gi])
                {
                    visited[gi] = 1u;
                    visited_n++;
                }

                if (visited_n >= GRID_N)
                {
#if EDGEAI_RENDER_SINGLE_BLIT
                    /* Guarantee background fully painted (remove any remaining black). */
                    edgeai_render_full_dune(tile);
#endif
                    if (!accel_inited)
                    {
                        found = edgeai_init_accel(&dev, &who);
                        accel_inited = true;
                    }
                    mode = EDGEAI_MODE_NORMAL;
                }
            }

            /* The trail is a ring buffer; one point is "removed" each frame when we overwrite
             * the head slot. Include that removed point in the dirty rect so we clear it,
             * otherwise stale dots can remain on-screen.
             */
            int32_t removed_tx = trail_x[trail_head];
            int32_t removed_ty = trail_y[trail_head];

            /* Update trail ring. */
            trail_x[trail_head] = (int16_t)cx;
            trail_y[trail_head] = (int16_t)cy;
            trail_head = (trail_head + 1u) % TRAIL_N;

            /* Dirty rect: cover previous and current ball + trail area. */
            int32_t minx_r = cx, miny_r = cy, maxx_r = cx, maxy_r = cy;
            for (int i = 0; i < TRAIL_N; i++)
            {
                int32_t tx = trail_x[i];
                int32_t ty = trail_y[i];
                if (tx < minx_r) minx_r = tx;
                if (ty < miny_r) miny_r = ty;
                if (tx > maxx_r) maxx_r = tx;
                if (ty > maxy_r) maxy_r = ty;
            }
            if (removed_tx < minx_r) minx_r = removed_tx;
            if (removed_ty < miny_r) miny_r = removed_ty;
            if (removed_tx > maxx_r) maxx_r = removed_tx;
            if (removed_ty > maxy_r) maxy_r = removed_ty;
            if (prev_x < minx_r) minx_r = prev_x;
            if (prev_y < miny_r) miny_r = prev_y;
            if (prev_x > maxx_r) maxx_r = prev_x;
            if (prev_y > maxy_r) maxy_r = prev_y;

            int32_t pad = BALL_R_MAX + 30;
            int32_t x0 = clamp_i32(minx_r - pad, 0, LCD_W - 1);
            int32_t y0 = clamp_i32(miny_r - pad, 0, LCD_H - 1);
            int32_t x1 = clamp_i32(maxx_r + pad, 0, LCD_W - 1);
            int32_t y1 = clamp_i32(maxy_r + pad, 0, LCD_H - 1);

            /* Clamp tile size; if motion ever causes a large dirty rect, cap it to a fixed size. */
            int32_t w = x1 - x0 + 1;
            int32_t h = y1 - y0 + 1;
            if (w > TILE_MAX_W || h > TILE_MAX_H)
            {
                int32_t halfw = TILE_MAX_W / 2;
                int32_t halfh = TILE_MAX_H / 2;
                int32_t ccx = (minx_r + maxx_r) / 2;
                int32_t ccy = (miny_r + maxy_r) / 2;
                x0 = clamp_i32(ccx - halfw, 0, LCD_W - 1);
                y0 = clamp_i32(ccy - halfh, 0, LCD_H - 1);
                x1 = clamp_i32(x0 + TILE_MAX_W - 1, 0, LCD_W - 1);
                y1 = clamp_i32(y0 + TILE_MAX_H - 1, 0, LCD_H - 1);
                w = x1 - x0 + 1;
                h = y1 - y0 + 1;
            }

#if EDGEAI_RENDER_SINGLE_BLIT
            /* Render into tile (black background) then blit once to avoid flicker/tearing lines. */
            sw_render_dune_bg(tile, (uint32_t)w, (uint32_t)h, x0, y0);

            /* Trails (streaks). */
            for (int i = 0; i < TRAIL_N; i++)
            {
                uint32_t idx = (trail_head + (uint32_t)i) % TRAIL_N;
                int32_t tx = trail_x[idx];
                int32_t ty = trail_y[idx];
                int r0 = 1 + (i / 6);
                uint16_t c = (i < 6) ? 0x39E7u : 0x18C3u;
                sw_render_filled_circle(tile, (uint32_t)w, (uint32_t)h, x0, y0, tx, ty, r0, c);
            }

            /* Depth cue: scale the ball/shadow with y-position. */
            sw_render_ball_shadow(tile, (uint32_t)w, (uint32_t)h, x0, y0, cx, cy, r_draw);
            sw_render_silver_ball(tile, (uint32_t)w, (uint32_t)h, x0, y0, cx, cy, r_draw, frame++, glint);

            par_lcd_s035_blit_rect(x0, y0, x1, y1, tile);
#else
            /* "Raster" mode: draw directly to LCD using multiple operations.
             * This is intentionally not a single-blit path; it can show tearing/raster lines.
             */
            par_lcd_s035_fill_rect(x0, y0, x1, y1, bg);

