telespial/EdgeAI_sphere_demo_NXP_FRDM-MCXN947/src/edgeai_sand_demo.c
            for (int i = 0; i < TRAIL_N; i++)
            {
                uint32_t idx = (trail_head + (uint32_t)i) % TRAIL_N;
                int32_t tx = trail_x[idx];
                int32_t ty = trail_y[idx];
                int r0 = 1 + (i / 6);
                uint16_t c = (i < 6) ? 0x39E7u : 0x18C3u;
                par_lcd_s035_draw_filled_circle(tx, ty, r0, c);
            }

            /* Depth cue: scale the ball/shadow with y-position. */
            par_lcd_s035_draw_ball_shadow(cx, cy, r_draw);
            par_lcd_s035_draw_silver_ball(cx, cy, r_draw, frame++, glint);
#endif

            prev_x = cx;
            prev_y = cy;
            stats_frames++;
        }

        /* NPU hook: run a Neutron-backed TFLM model at a low rate and use output to modulate "glint". */
        if (EDGEAI_ENABLE_NPU_INFERENCE && npu_ok && (npu_accum_us >= 200000u))
        {
            npu_accum_us = 0;

            /* Fill input tensor with a synthetic pattern derived from motion/tilt.
             * This is a placeholder input; replace with real features later.
             */
            uint32_t n = 1;
            if (in_dims.size >= 2) n = in_dims.data[1];
            if (in_dims.size >= 3) n *= in_dims.data[2];
            if (in_dims.size >= 4) n *= in_dims.data[3];

            uint8_t base = 127u;
            uint8_t amp = (uint8_t)clamp_i32((int32_t)((vx_q16 < 0 ? -vx_q16 : vx_q16) >> 16) +
                                             (int32_t)((vy_q16 < 0 ? -vy_q16 : vy_q16) >> 16), 0, 80);
            for (uint32_t i = 0; i < n; i++)
            {
                /* simple repeating waveform */
                uint8_t t = (uint8_t)(i & 31u);
                uint8_t v = (t < 16u) ? (uint8_t)(base + (amp * t) / 16u) : (uint8_t)(base + (amp * (31u - t)) / 16u);
                in_data[i] = v;
            }

            if (EDGEAI_MODEL_RunInference() == kStatus_Success)
            {
                /* Convert model output to 0..255. */
                uint32_t m = 0;
                uint32_t out_n = 1;
                if (out_dims.size >= 1) out_n = out_dims.data[0];
                if (out_dims.size >= 2) out_n *= out_dims.data[1];
                if (out_dims.size >= 3) out_n *= out_dims.data[2];
                if (out_dims.size >= 4) out_n *= out_dims.data[3];
                if (out_n == 0) out_n = 1;

                if (out_type == kEdgeAiTensorType_UINT8)
                {
                    for (uint32_t i = 0; i < out_n; i++) if (out_data[i] > m) m = out_data[i];
                    glint = (uint8_t)m;
                }
                else if (out_type == kEdgeAiTensorType_INT8)
                {
                    int8_t *p = (int8_t *)out_data;
                    int32_t mm = -128;
                    for (uint32_t i = 0; i < out_n; i++) if ((int32_t)p[i] > mm) mm = (int32_t)p[i];
                    glint = (uint8_t)clamp_i32(mm + 128, 0, 255);
                }
                else
                {
                    /* float32 */
                    float *p = (float *)out_data;
                    float mm = p[0];
                    for (uint32_t i = 1; i < out_n; i++) if (p[i] > mm) mm = p[i];
                    if (mm < 0.0f) mm = 0.0f;
                    if (mm > 1.0f) mm = 1.0f;
                    glint = (uint8_t)(mm * 255.0f);
                }
            }
        }

        if (stats_accum_us >= 1000000u)
        {
            uint32_t fps = stats_frames;
            stats_accum_us = 0;
            stats_frames = 0;
            PRINTF("EDGEAI: fps=%u raw=(%d,%d,%d) lp=(%d,%d) pos=(%d,%d) v=(%d,%d) glint=%u npu=%u\r\n",
                   (unsigned)fps,
                   (int)s.x, (int)s.y, (int)s.z,
                   (int)ax_lp, (int)ay_lp,
                   (int)cx, (int)cy,
                   (int)(vx_q16 >> 16), (int)(vy_q16 >> 16),
                   (unsigned)glint,
                   (unsigned)(npu_ok ? 1u : 0u));
        }
    }
}
